In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.read_csv("Bengaluru_House_Data.csv")

In [4]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [6]:
df.area_type.unique()

array(['Super built-up  Area', 'Plot  Area', 'Built-up  Area',
       'Carpet  Area'], dtype=object)

In [7]:
df.area_type.value_counts()

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [8]:
df["area_type"] = df["area_type"].str.replace("-"," ")

In [9]:
df["area_type"].unique()

array(['Super built up  Area', 'Plot  Area', 'Built up  Area',
       'Carpet  Area'], dtype=object)

In [10]:
df.availability.value_counts()

Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: availability, Length: 81, dtype: int64

In [11]:
df["availability"] = df["availability"].str.replace("-","")

In [12]:
df["availability"].value_counts()

Ready To Move    10581
18Dec              307
18May              295
18Apr              271
18Aug              200
                 ...
15Aug                1
17Jan                1
16Nov                1
16Jan                1
14Jul                1
Name: availability, Length: 81, dtype: int64

In [13]:
location_counts = df["location"].value_counts()

In [14]:
location_less_than_10 = location_counts[location_counts<10]

In [15]:
df["location"] = df["location"].apply(lambda x:"others" if x in location_less_than_10 else x)

In [16]:
df["location"].value_counts()

others              2780
Whitefield           540
Sarjapur  Road       399
Electronic City      302
Kanakpura Road       273
                    ...
Basapura              10
Dodsworth Layout      10
Kalkere               10
Ganga Nagar           10
Nagadevanahalli       10
Name: location, Length: 254, dtype: int64

In [17]:
df.corr().price

bath       0.456345
balcony    0.120355
price      1.000000
Name: price, dtype: float64

In [18]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built up Area,19Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [19]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [20]:
df["size"].isna().sum()

16

In [21]:
df["size"] = df["size"].str.split(" ").str.get(0)

In [22]:
df["size"].unique()

array(['2', '4', '3', '6', '1', '8', '7', '5', '11', '9', nan, '27', '10',
       '19', '16', '43', '14', '12', '13', '18'], dtype=object)

In [23]:
df[df["size"].isna()]

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
579,Plot Area,Immediate Possession,Sarjapur Road,NaN,Asiss B,1200 - 2400,NaN,NaN,34.185
1775,Plot Area,Immediate Possession,others,NaN,Orana N,2000 - 5634,NaN,NaN,124.000
2264,Plot Area,Immediate Possession,Banashankari,NaN,NaN,2400,NaN,NaN,460.000
2809,Plot Area,Immediate Possession,Sarjapur Road,NaN,AsdiaAr,1200 - 2400,NaN,NaN,28.785
2862,Plot Area,Immediate Possession,Devanahalli,NaN,Ajleyor,1500 - 2400,NaN,NaN,46.800
5333,Plot Area,Immediate Possession,Devanahalli,NaN,Emngs S,2100 - 5405,NaN,NaN,177.115
6423,Plot Area,Immediate Possession,Whitefield,NaN,SRniaGa,2324,NaN,NaN,26.730
6636,Plot Area,Immediate Possession,Jigani,NaN,S2enste,1500,NaN,NaN,25.490
6719,Plot Area,Immediate Possession,Hoskote,NaN,SJowsn,800 - 2660,NaN,NaN,28.545
7680,Plot Area,Immediate Possession,Kasavanhalli,NaN,NaN,5000,NaN,NaN,400.000
8306,Plot Area,Immediate Possession,Anekal,NaN,Vaensnd,1453,NaN,NaN,16.500
8565,Plot Area,Immediate Possession,others,NaN,Ocezes,2000,NaN,NaN,120.000
8703,Plot Area,Immediate Possession,Mysore Road,NaN,Naoden,1200 - 2400,NaN,NaN,42.300
10634,Plot Area,Immediate Possession,others,NaN,NaN,1575,NaN,NaN,31.110
11019,Plot Area,Immediate Possession,Yelahanka,NaN,Saaveha,1200 - 1800,NaN,NaN,12.750
11569,Plot Area,Immediate Possession,Hosur Road,NaN,AVeldun,1350,NaN,NaN,8.440

In [24]:
df.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [25]:
df["size"] = df["size"].fillna(0)

In [26]:
df["size"].isna().sum()

0

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13320 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [28]:
df.isna().sum()

area_type          0
availability       0
location           1
size               0
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [29]:
df["size"] = df["size"].astype(int)

In [30]:
df["bath"] = df["bath"].fillna(df["bath"].mode())

In [31]:
df["balcony"] = df["balcony"].fillna(df["balcony"].mode())

In [32]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built up Area,19Dec,Electronic City Phase II,2,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600,5.0,3.0,120.00
2,Built up Area,Ready To Move,Uttarahalli,3,NaN,1440,2.0,3.0,62.00
3,Super built up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521,3.0,1.0,95.00
4,Super built up Area,Ready To Move,Kothanur,2,NaN,1200,2.0,1.0,51.00

In [33]:
df.describe()

               size          bath       balcony         price
count  13320.000000  13247.000000  12711.000000  13320.000000
mean       2.800375      2.692610      1.584376    112.565627
std        1.297835      1.341458      0.817263    148.971674
min        0.000000      1.000000      0.000000      8.000000
25%        2.000000      2.000000      1.000000     50.000000
50%        3.000000      2.000000      2.000000     72.000000
75%        3.000000      3.000000      2.000000    120.000000
max       43.000000     40.000000      3.000000   3600.000000

In [34]:
df["total_sqft"].value_counts()

1200    843
1100    221
1500    205
2400    196
600     180
       ...
3580      1
2461      1
1437      1
2155      1
4689      1
Name: total_sqft, Length: 2117, dtype: int64

In [35]:
def convert_total_sqft(x):
    num = x.split("-")
    
    if len(num) == 2:
        return (float(num[0])+float(num[1]))/2
    try :
        return float(x)
    except:
        return None

In [36]:
df["total_sqft"] = df["total_sqft"].apply(convert_total_sqft)

In [37]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built up Area,19Dec,Electronic City Phase II,2,Coomee,1056.0,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600.0,5.0,3.0,120.00
2,Built up Area,Ready To Move,Uttarahalli,3,NaN,1440.0,2.0,3.0,62.00
3,Super built up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521.0,3.0,1.0,95.00
4,Super built up Area,Ready To Move,Kothanur,2,NaN,1200.0,2.0,1.0,51.00

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13320 non-null  int32
 4   society       7818 non-null   object
 5   total_sqft    13274 non-null  float64
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(4), int32(1), object(4)
memory usage: 884.7+ KB

In [39]:
df["price"]*100000

0         3907000.0
1        12000000.0
2         6200000.0
3         9500000.0
4         5100000.0
            ...
13315    23100000.0
13316    40000000.0
13317     6000000.0
13318    48800000.0
13319     1700000.0
Name: price, Length: 13320, dtype: float64

In [40]:
df["price_per_sqft"] = df["price"]*100000/df["total_sqft"]

In [41]:
df.describe()

,size,total_sqft,bath,balcony,price,price_per_sqft
count,13320.000000,13274.000000,13247.000000,12711.000000,13320.000000,1.327400e+04
mean,2.800375,1559.626694,2.692610,1.584376,112.565627,7.907501e+03
std,1.297835,1238.405258,1.341458,0.817263,148.971674,1.064296e+05
min,0.000000,1.000000,1.000000,0.000000,8.000000,2.678298e+02
25%,2.000000,1100.000000,2.000000,1.000000,50.000000,4.266865e+03
50%,3.000000,1276.000000,2.000000,2.000000,72.000000,5.434306e+03
75%,3.000000,1680.000000,3.000000,2.000000,120.000000,7.311746e+03
max,43.000000,52272.000000,40.000000,3.000000,3600.000000,1.200000e+07

In [42]:
df = df[df["price_per_sqft"]<10e4]

In [43]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price,price_per_sqft
0,Super built up Area,19Dec,Electronic City Phase II,2,Coomee,1056.0,2.0,1.0,39.07,3699.810606
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600.0,5.0,3.0,120.00,4615.384615
2,Built up Area,Ready To Move,Uttarahalli,3,NaN,1440.0,2.0,3.0,62.00,4305.555556
3,Super built up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521.0,3.0,1.0,95.00,6245.890861
4,Super built up Area,Ready To Move,Kothanur,2,NaN,1200.0,2.0,1.0,51.00,4250.000000
...,...,...,...,...,...,...,...,...,...,...
13315,Built up Area,Ready To Move,Whitefield,5,ArsiaEx,3453.0,4.0,0.0,231.00,6689.834926
13316,Super built up Area,Ready To Move,others,4,NaN,3600.0,5.0,NaN,400.00,11111.111111
13317,Built up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,1141.0,2.0,1.0,60.00,5258.545136
13318,Super built up Area,18Jun,Padmanabhanagar,4,SollyCl,4689.0,4.0,1.0,488.00,10407.336319
13319,Super built up Area,Ready To Move,Doddathoguru,1,NaN,550.0,1.0,1.0,17.00,3090.909091

In [44]:
df = df[df["price_per_sqft"]>1e3]

In [45]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price,price_per_sqft
0,Super built up Area,19Dec,Electronic City Phase II,2,Coomee,1056.0,2.0,1.0,39.07,3699.810606
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600.0,5.0,3.0,120.00,4615.384615
2,Built up Area,Ready To Move,Uttarahalli,3,NaN,1440.0,2.0,3.0,62.00,4305.555556
3,Super built up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521.0,3.0,1.0,95.00,6245.890861
4,Super built up Area,Ready To Move,Kothanur,2,NaN,1200.0,2.0,1.0,51.00,4250.000000
...,...,...,...,...,...,...,...,...,...,...
13315,Built up Area,Ready To Move,Whitefield,5,ArsiaEx,3453.0,4.0,0.0,231.00,6689.834926
13316,Super built up Area,Ready To Move,others,4,NaN,3600.0,5.0,NaN,400.00,11111.111111
13317,Built up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,1141.0,2.0,1.0,60.00,5258.545136
13318,Super built up Area,18Jun,Padmanabhanagar,4,SollyCl,4689.0,4.0,1.0,488.00,10407.336319
13319,Super built up Area,Ready To Move,Doddathoguru,1,NaN,550.0,1.0,1.0,17.00,3090.909091

In [46]:
df = df[df["bath"]<10]

In [47]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price,price_per_sqft
0,Super built up Area,19Dec,Electronic City Phase II,2,Coomee,1056.0,2.0,1.0,39.07,3699.810606
1,Plot Area,Ready To Move,Chikka Tirupathi,4,Theanmp,2600.0,5.0,3.0,120.00,4615.384615
2,Built up Area,Ready To Move,Uttarahalli,3,NaN,1440.0,2.0,3.0,62.00,4305.555556
3,Super built up Area,Ready To Move,Lingadheeranahalli,3,Soiewre,1521.0,3.0,1.0,95.00,6245.890861
4,Super built up Area,Ready To Move,Kothanur,2,NaN,1200.0,2.0,1.0,51.00,4250.000000
...,...,...,...,...,...,...,...,...,...,...
13315,Built up Area,Ready To Move,Whitefield,5,ArsiaEx,3453.0,4.0,0.0,231.00,6689.834926
13316,Super built up Area,Ready To Move,others,4,NaN,3600.0,5.0,NaN,400.00,11111.111111
13317,Built up Area,Ready To Move,Raja Rajeshwari Nagar,2,Mahla T,1141.0,2.0,1.0,60.00,5258.545136
13318,Super built up Area,18Jun,Padmanabhanagar,4,SollyCl,4689.0,4.0,1.0,488.00,10407.336319
13319,Super built up Area,Ready To Move,Doddathoguru,1,NaN,550.0,1.0,1.0,17.00,3090.909091

In [48]:
df.corr().price

size              0.414925
total_sqft        0.709686
bath              0.479039
balcony           0.121885
price             1.000000
price_per_sqft    0.672513
Name: price, dtype: float64

In [49]:
df.drop(columns=["price_per_sqft","availability","society"],inplace=True)

C:\Users\Vikram\AppData\Local\Temp\ipykernel_1168\1619748942.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop(columns=["price_per_sqft","availability","society"],inplace=True)

In [50]:
df.dropna(inplace=True)

C:\Users\Vikram\AppData\Local\Temp\ipykernel_1168\1379821321.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.dropna(inplace=True)

In [51]:
df.isna().sum()

area_type     0
location      0
size          0
total_sqft    0
bath          0
balcony       0
price         0
dtype: int64

In [52]:
df.to_csv("cleaning_data.csv")

In [53]:
df.shape

(12642, 7)

In [54]:
x = df.drop("price",axis = 1)

In [55]:
y = df["price"]

In [56]:
from sklearn.model_selection import train_test_split

In [57]:
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2,random_state=42)

In [58]:
x_train.shape,x_test.shape

((10113, 6), (2529, 6))

In [59]:
from sklearn.ensemble import RandomForestRegressor
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import r2_score
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline

In [60]:
df.head()

,area_type,location,size,total_sqft,bath,balcony,price
0,Super built up Area,Electronic City Phase II,2,1056.0,2.0,1.0,39.07
1,Plot Area,Chikka Tirupathi,4,2600.0,5.0,3.0,120.00
2,Built up Area,Uttarahalli,3,1440.0,2.0,3.0,62.00
3,Super built up Area,Lingadheeranahalli,3,1521.0,3.0,1.0,95.00
4,Super built up Area,Kothanur,2,1200.0,2.0,1.0,51.00

In [61]:
ohe = OneHotEncoder()

In [62]:
ohe.fit([["area_type","location"]])

OneHotEncoder()

In [63]:
column_trans = make_column_transformer((OneHotEncoder(sparse=False),["area_type","location"]),
                                      remainder = "passthrough")

In [64]:
scaler = StandardScaler()

In [65]:
model = RandomForestRegressor()

In [66]:
pipe = make_pipeline(column_trans,scaler,model)

In [67]:
pipe.fit(x_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['area_type', 'location'])])),
                ('standardscaler', StandardScaler()),
                ('randomforestregressor', RandomForestRegressor())])

In [68]:
pred = pipe.predict(x_test)

In [69]:
r2_score(y_test,pred)

0.6268946785247871

In [70]:
import pickle

In [71]:
pickle.dump(pipe,open("bengaluru_house.pkl","wb"))